{"quotes": ["When love beckons to you, follow him, though his ways are hard and steep. And when his wings enfold you yield to him, though the sword hidden among his pinions may wound you.", "For even as love crowns you so shall he crucify you. Even as he is for your growth so is he for your pruning.", "All these things shall love do unto you that you may know the secrets of your heart, and in that knowledge become a fragment of Life's heart.", "If in your fear you would seek only love's peace and love's pleasure then it is better for you that you cover your nakedness and pass out of love's threshing floor, into the seasonless world where you shall laugh, but not all of your laughter, and weep, but not all of your tears.", "Love has no other desire but to fulfill itself. But if you love and must needs have desires, let these be your desires: To melt and be like a running brook that sings its melody to the night.", "To know the pain of too much tenderness. To be wounded by your own understanding of love; And to bleed willingly and joyfully.", "To wake at dawn with a winged heart and give thanks for another day of loving; To rest at the noon hour and meditate love's ecstasy; to return home at eventide with gratitude; And then to sleep with a prayer for the beloved in your heart and a song of praise upon your lips.", "You were born together, and together you shall be forever more. You shall be together when the white wings of death scatter your days. Ay, you shall be together even in the silent memory of God.", "But let there be spaces in your togetherness, And let the winds of the heavens dance between you.", "Fill each other's cup, but drink not from one cup.Give one another of your bread, but eat not from the same loaf. Sing and dance together and be joyous, but let each of you be alone, Even as the strings of a lute are alone though they quiver with the same music.", "Give your hearts, but not into each other's keeping. For only the hand of Life can contain your hearts.And stand together yet not too near together:For the pillars of the temple stand apart,And the oak tree and the cypress grow not in each other's shadow.", "Your children are not your children. They are the sons and daughters of Life's longing for itself. They come through you but not from you, And though they are with you yet they belong not to you. You may give them your love but not your thoughts, For they have their own thoughts.", "You may house their bodies but not their souls, For their souls dwell in the house of tomorrow, which you cannot visit, not even in your dreams. You may strive to be like them, but seek not to make them like you. For life goes not backward nor tarries with yesterday.", "You are the bows from which your children as living arrows are sent forth. The archer sees the mark upon the path of the infinite, and He bends you with His might that His arrows may go swift and far.", "Let your bending in the archer's hand be for gladness; For even as he loves the arrow that flies, so He loves also the bow that is stable.", "You give but little when you give of your possessions. It is when you give of yourself that you truly give.", "The deeper sorrow carves into your being, the more joy you can contain.", "Your joy is your sorrow unmasked. And the selfsame well from which your laughter rises was often time filled with your tears...", "When you are joyous, look deep into your heart and you shall find it is only that which has given you sorrow that is giving you joy. When you are sorrowful look again in your heart, and you shall see that in truth you are weeping for that which has been your delight.", "The lust for comfort, that stealthy thing that enters the house a guest, and then becomes a host, and then a master.", "Your soul is oftentimes a battlefield, upon which your reason and your judgment wage war against your passion and your appetite.", "Would that I could be the peacemaker in your soul, that I might turn the discord and the rivalry of your elements into oneness and melody. But how shall I, unless you yourselves be also the peacemakers, nay, the lovers of all your elements?", "For reason, ruling alone, is a force confining; and passion, unattended, is a flame that burns to its own destruction.", "Let your soul exalt your reason to the height of passion, that it may sing; And let it direct your passion with reason, that your passion may live through its own daily resurrection, and like the phoenix rise above its own ashes.", "Could you keep your heart in wonder at the daily miracles of your life, your pain would not seem less wondrous than your joy; and you would accept the seasons of your heart, even as you have always accepted the seasons that pass over your fields.", "The hidden well-spring of your soul must needs rise and run murmuring to the sea; And the treasure of your infinite depths would be revealed to your eyes.", "Let there be no scales to weigh your unknown treasure; And seek not the depths of your knowledge with staff or sounding line. For self is a sea boundless and measureless.", "Say not, \"I have found the truth,\" but rather, \"I have found a truth.\" Say not, \"I have found the path of the soul.\" Say rather, \"I have found the soul walking upon my path.\"", "For the soul walks upon all paths. The soul walks not upon a line, neither does it grow like a reed. The soul unfolds itself, like a lotus of countless petals.", "Your friend is your needs answered. He is your field which you sow with love and reap with thanksgiving. And he is your board and your fireside. For you come to him with your hunger, and you seek him for peace.", "Your friend is your needs answered. He is your field which you sow with love and reap with thanksgiving. And he is your board and your fireside. For you come to him with your hunger, and you seek him for peace.", "Your friend is your needs answered. He is your field which you sow with love and reap with thanksgiving. And he is your board and your fireside. For you come to him with your hunger, and you seek him for peace.", "And let there be no purpose in friendship save the deepening of the spirit. For love that seeks aught but the disclosure of its own mystery is not love but a net cast forth: and only the unprofitable is caught.", "And let there be no purpose in friendship save the deepening of the spirit. For love that seeks aught but the disclosure of its own mystery is not love but a net cast forth: and only the unprofitable is caught.", "And let there be no purpose in friendship save the deepening of the spirit. For love that seeks aught but the disclosure of its own mystery is not love but a net cast forth: and only the unprofitable is caught.", "Of time you would make a stream upon whose bank you would sit and watch its flowing. Yet the timeless in you is aware of life's timelessness, And knows that 'yesterday is but today's memory and tomorrow is today's dream.", "And that which sings and contemplates in you is still dwelling within the bounds of that first moment which scattered the stars into space.", "And is not time even as love is, undivided and paceless? But if in you thought you must measure time into seasons, let each season encircle all the other seasons, And let today embrace the past with remembrance and the future with longing.", "Let us disperse from our aloofness and serve the weak who made us strong, and cleanse the country in which we live. Let us teach this miserable nation to smile and rejoice with heaven's bounty and glory of life and freedom.", "The creator gives no heed to the critic unless he becomes a barren inventor.", "My enemy said to me, \"Love your enemy.\" And I obeyed him and loved myself.", "Progress lies not in enhancing what is, but in advancing toward what will be.", "The tears that you spill, the sorrowful, are sweeter than the laughter of snobs and the guffaws of scoffers.", "Man struggles to find life outside himself, unaware that the life he is seeking is within him.", "To understand the heart and mind of a person, look not at what he has already achieved, but what he aspires to.", "I know faces, because I look through the fabric my own eye weaves, and behold the reality beneath.", "I go as others already crucified have gone. And think not we are weary of crucifixion. For we must be crucified by larger and yet larger men, between greater earths and greater heavens.", "Love gives naught but itself and takes naught but from itself. Love possesses not nor would it be possessed; For love is sufficient unto love.", "Say not, \"I have found the path of the soul.\" Say rather, \"I have found the soul walking upon my path.\" For the soul walks upon all paths. The soul walks not upon a line, neither does it grow like a reed. The soul unfolds itself, like a lotus of countless petals.", "Your pain is the breaking of the shell that encloses your understanding. Even as the stone of the fruit must break, that its heart may stand in the sun, so must you know pain.", "Love knows not its own depth until the hour of separation.", "For in truth it is life that gives unto life-while you, who deem yourself a giver, are but a witness.", "Half of what I say is meaningless, but I say it so that the other half may reach you.", "A sense of humour is a sense of proportion.", "The reality of the other person is not in what he reveals to you, but in what he cannot reveal to you. Therefore, if you would understand him, listen not to what he says but rather to what he does not say.", "My loneliness was born when men praised my talkative faults and blamed my silent virtues.", "When Life does not find a singer to sing her heart she produces a philosopher to speak her mind.", "A truth is to be known always, to be uttered sometimes.", "If you sing of beauty though alone in the heart of the desert you will have an audience.", "Solitude is a silent storm that breaks down all our dead branches; Yet it sends our living roots deeper into the living heart of the living earth.", "Strange that creatures without backbones have the hardest shells.", "Friendship is always a sweet responsibility, never an opportunity.", "There must be something strangely sacred about salt. It is in our tears and in the sea", "I would be the least among men with dreams and the desire to fulfill them, rather than the greatest with no dreams and no desires.", "In truth we gaze but do not see, and hearken but do not hear; we eat and drink but do not taste. And there lies the difference between Jesus of Nazareth and ourselves. His senses were all continually made new, and the world to Him was always a new world.", "He was gentle, like a man mindful of his own strength. In my dreams I beheld the kings of the earth standing in awe in His presence.", "I have pondered long, and I know now that only the pure of heart forgive the thirst that leads to dead waters. And only the sure of foot can give a hand to him who stumbles.", "I would tell you more of Him, but how shall I? When love becomes vast love becomes wordless. And when memory is overladen it seeks the silent deep.", "In a dream I saw Jesus and My God Pan sitting together in the heart of the forest. They laughed at each other's speech, with the brook that ran near them, and the laughter of Jesus was the merrier. And they conversed long.", "You hate Jesus because someone from the North Country said He was the Son of God. But you hate one another because each of you deems himself too great to be the brother of the next man.", "Master, master singer, Master of words unspoken, Seven times was I born, and seven times have I died Since your last hasty visit and our brief welcome. And behold I live again, Remembering a day and a night among the hills, When your tide lifted us up.", "Men would bless you or curse you; The curse, a protest against failure, The blessing, a hymn of the hunter Who comes back from the hills With provision for his mate.", "You laughed for the marrow in their bones that was not yet ready for laughter; And you wept for their eyes that yet were dry. Your voice fathered their thoughts and their understanding. Your voice mothered their words and their breath.", "Master, Master of Light, Whose eye dwells in the seeking fingers of the blind, You are still despised and mocked, A man too weak and infirm to be God, A God too much man to call forth adoration.", "But Master, Sky-heart, Knight of our fairer dream, You do still tread this day; Nor bows nor spears shall stay your steps. You walk through all our arrows.", "Poet, Singer, Great Heart, May our God bless your name, And the womb that held you, and the breasts that gave you milk. And may God forgive us all.", "Life without Liberty is like a body without spirit. Liberty without thought is like a disturbed spirit. Life, liberty, and thought -- three persons in one substance, eternal, never-ending, and unceasing.", "Love and what generates it. Rebellion and what creates it. Liberty and what nourishes it. Three manifestations of God. And God is the conscience of the rational world.", "Yesterday we obeyed kings and bent our necks before emperors. But today we kneel only to truth, follow only beauty, and obey only love.", "My yearning is my cup, my burning thirst is my drink, and my solitude is my intoxication; I do not and shall not quench my thirst. But in this burning that is never extinguished is a joy that never wanes.", "My Soul gave me good counsel, teaching me to touch what has never taken corporeal form or crystallized. It made me understand that touching something is half the task of comprehending it, and that what we grasp therein is part of what we desire from it.", "My Soul gave me good counsel, teaching me that the lamp which I carry does not belong to me, and the song that I sing was not generated from within me. Even if I walk with light, I am not the light; and if I am a taut-stringed lute, I am not the lute player.", "My thought is a tender leaf that sways in every direction and finds pleasure in its swaying. Your thought is an ancient dogma that cannot change you nor can you change it. My thought is new, and it tests me and I test it morn and eve. You have your thought and I have mine.", "Vain are the beliefs and teachings that make man miserable, and false is the goodness that leads him into sorrow and despair, for it is man's purpose to be happy on this earth and lead the way to felicity and preach its gospel wherever he goes.", "I believe that you can say to Abraham Lincoln, the blessed, \"Jesus of Nazareth touched your lips when you spoke, and guided your hand when you wrote; and I shall uphold all that you have said and all that you have written.\"", "I believe that you can say to Emerson and Whitman and James, \"In my veins runs the blood of the poets and wise men of old, and it is my desire to come to you and receive, but I shall not come with empty hands.\"", "I believe that even as your fathers came to this land to produce riches, you were born here to produce riches by intelligence, by labor. I believe that it is in you to be good citizens.", "My friend, I am not what I seem. Seeming is but a garment I wear -- a care-woven garment that protects me from thy questionings and thee from my negligence.", "You are your own forerunner, and the towers you have builded are but the foundation of your giant-self. And that self too shall be a foundation.", "And I too am my own forerunner, for the long shadow stretching before me at sunrise shall gather under my feet at the noon hour. Yet another sunrise shall lay another shadow before me, and that also shall be gathered at another noon. ", "Always have we been our own forerunners, and always shall we be. And all that we have gathered and shall gather shall be but seeds for fields yet unploughed. We are the fields and the ploughmen, the gatherers and the gathered.", "We are the fields and the ploughmen, the gatherers and the gathered.", "O love, whose lordly hand has bridled my desires, and raised my hunger and my thirst. To dignity and pride, let not the strong in me and the constant eat the bread or drink the wine that tempt my weaker self.", "Let me rather starve, and let my heart parch with thirst, and let me die and perish, ere I stretch my hand to a cup you did not fill, or a bowl you did not bless.", "I have existed from all eternity and, behold, I am here; and I shall exist till the end of time, for my being has no end.", "I soared into limitless space and took wing in the imaginal world, approaching the circle of exalted light; and here I am now, mired in matter. ", "I listened to the teachings of Confucius, imbibed the wisdom of Brahma, and sat beside Buddha beneath the tree of insight. And now I am here, wrestling with ignorance and unbelief.", "I was on Sinai when Yahweh shed his effulgence on Moses; at the River Jordan I witnessed the miracles of the Nazarene; and in Medina I heard the words of the Messenger to the Arabs. And here I am now, a captive of confusion.", "How amazing time is, and how amazing we are. Time has been transformed, and we have changed; it has advanced and set us in motion; it has unveiled its face, inspiring us with bewilderment and exhilaration.", "Yesterday we complained of time and feared it, but today we love and embrace it. Indeed, we have begun to perceive its purposes and characteristics, and to comprehend its secrets and enigmas.", "All that you see was and is for your sake. The numerous books, uncanny markings, and beautiful thoughts are the ghosts of souls who preceded you. The speech they weave is a link between you and your human siblings.", "The consequences that cause sorrow and rapture are the seeds that the past has sown in the field of the soul, and by which the future shall profit.", "My Soul gave me good counsel, teaching me to love what the people abhor and to show good will toward the one they hate. It showed me that Love is a property not of the lover but of the beloved.", "Before my Soul taught me, Love was for me a delicate thread stretched between two adjacent pegs, but now it has been transformed into a halo; its first is its last, and its last is its first. It encompasses every being, slowly expanding to embrace all that ever will be.", "My Soul gave me good counsel, teaching me not to measure time by saying, \"It was yesterday, and will be tomorrow.\" Before my Soul taught me, I imagined the past as an era not to be met with, and the future as an age that I would never witness.", "But now I know that in the brief moment of the present, all time exists, including everything that is in time -- all that is eagerly anticipated, achieved, or realized.", "My Soul gave me good counsel, teaching me not to define a place by saying 'here' or 'there'.", "Before my Soul taught me, I thought that when I was in any place on the earth I was remote from every other spot. But now I have learned that the place where I subsist is all places, and the space I occupy is all intervals.", "My Soul gave me good counsel, teaching me never to delight in praise or to be distressed by reproach. Before my Soul taught me, I doubted the value of my accomplishments until the passing days sent someone who would extol or disparage them.", "But now I know that trees blossom in the spring and give their fruits in the summer without any desire for accolades. And they scatter their leaves abroad in the fall and denude themselves in the winter without fear of reproof.", "My Soul gave me good counsel, teaching me and demonstrating to me that I am not exalted over the panhandler nor less than the mighty.", "Before my Soul taught me, I thought people consisted of two types: the weak, whom I pitied and disregarded, and the powerful, whom I followed or against I rebelled.", "Now, I have discovered that I was formed as one individual from the same substance from which all human beings were created. I am made up of the same elements as they are, and my pattern is theirs. My struggles are theirs, and my path is theirs.", "Your thought describes laws, courts, judges, punishments. Mine explains that when man makes a law, he either violates it or obeys it.", "If there is a basic law, we are all one before it. He who disdains the mean is himself mean. He who vaunts his scorn of the sinful vaunts his disdain of all humanity.", "Your thought sees power in armies, cannons, battleships, submarines, aeroplanes, and poison gas. But mine asserts that power lies in reason, resolution, and truth. No matter how long the tyrant endures, he will be the loser at the end. ", "Your thought differentiates between pragmatist and idealist, between the part and the whole, between the mystic and materialist. Mine realizes that life is one and its weights, measures and tables do not coincide with your weights, measures and tables.", "He whom you suppose an idealist may be a practical man.", "Wisdom ceases to be wisdom when it becomes too proud to weep, too grave to laugh, and too selfish to seek other than itself.", "The teacher who is indeed wise does not bid you to enter the house of his wisdom but rather leads you to the threshold of your mind.", "Life without love is like a tree without blossoms or fruit.", "Keep me away from the wisdom which does not cry, the philosophy which does not laugh and the greatness which does not bow before children.", "We choose our joys and sorrows long before we experience them.", "Be like the flower, turn your face to the sun.", "To understand the heart and mind of a person, look not at what he has already achieved, but at what he aspires to do.", "Your friend is your needs answered.", "In the sweetness of friendship let there be laughter and sharing of pleasures. For in the dew of little things the heart finds its morning and is refreshed.", "Friendship is always a sweet responsibility, never an opportunity.", "Pain and foolishness lead to great bliss and complete knowledge, for Eternal Wisdom created nothing under the sun in vain.", "Let there be no purpose in friendship save the deepening of the spirit.", "A little knowledge that acts is worth infinitely more than much knowledge that is idle.", "Beauty is not in the face; beauty is a light in the heart.", "When love beckons to you, follow him, though his ways are hard and steep. And when his wings enfold you yield to him, though the sword hidden among his pinions may wound you.", "For even as love crowns you so shall he crucify you. Even as he is for your growth so is he for your pruning.", "All these things shall love do unto you that you may know the secrets of your heart, and in that knowledge become a fragment of Life's heart.", "If in your fear you would seek only love's peace and love's pleasure then it is better for you that you cover your nakedness and pass out of love's threshing floor, into the seasonless world where you shall laugh, but not all of your laughter, and weep, but not all of your tears.", "Love has no other desire but to fulfill itself. But if you love and must needs have desires, let these be your desires: To melt and be like a running brook that sings its melody to the night.", "To know the pain of too much tenderness. To be wounded by your own understanding of love; And to bleed willingly and joyfully.", "To wake at dawn with a winged heart and give thanks for another day of loving; To rest at the noon hour and meditate love's ecstasy; to return home at eventide with gratitude; And then to sleep with a prayer for the beloved in your heart and a song of praise upon your lips.", "You were born together, and together you shall be forever more. You shall be together when the white wings of death scatter your days. Ay, you shall be together even in the silent memory of God.", "But let there be spaces in your togetherness, And let the winds of the heavens dance between you.", "Fill each other's cup, but drink not from one cup.Give one another of your bread, but eat not from the same loaf. Sing and dance together and be joyous, but let each of you be alone, Even as the strings of a lute are alone though they quiver with the same music.", "Give your hearts, but not into each other's keeping. For only the hand of Life can contain your hearts.And stand together yet not too near together:For the pillars of the temple stand apart,And the oak tree and the cypress grow not in each other's shadow.", "Your children are not your children. They are the sons and daughters of Life's longing for itself. They come through you but not from you, And though they are with you yet they belong not to you. You may give them your love but not your thoughts, For they have their own thoughts.", "You may house their bodies but not their souls, For their souls dwell in the house of tomorrow, which you cannot visit, not even in your dreams. You may strive to be like them, but seek not to make them like you. For life goes not backward nor tarries with yesterday.", "You are the bows from which your children as living arrows are sent forth. The archer sees the mark upon the path of the infinite, and He bends you with His might that His arrows may go swift and far.", "Let your bending in the archer's hand be for gladness; For even as he loves the arrow that flies, so He loves also the bow that is stable.", "You give but little when you give of your possessions. It is when you give of yourself that you truly give.", "The deeper sorrow carves into your being, the more joy you can contain.", "Your joy is your sorrow unmasked. And the selfsame well from which your laughter rises was often time filled with your tears...", "When you are joyous, look deep into your heart and you shall find it is only that which has given you sorrow that is giving you joy. When you are sorrowful look again in your heart, and you shall see that in truth you are weeping for that which has been your delight.", "The lust for comfort, that stealthy thing that enters the house a guest, and then becomes a host, and then a master.", "Your soul is oftentimes a battlefield, upon which your reason and your judgment wage war against your passion and your appetite.", "Would that I could be the peacemaker in your soul, that I might turn the discord and the rivalry of your elements into oneness and melody. But how shall I, unless you yourselves be also the peacemakers, nay, the lovers of all your elements?", "For reason, ruling alone, is a force confining; and passion, unattended, is a flame that burns to its own destruction.", "Let your soul exalt your reason to the height of passion, that it may sing; And let it direct your passion with reason, that your passion may live through its own daily resurrection, and like the phoenix rise above its own ashes.", "Could you keep your heart in wonder at the daily miracles of your life, your pain would not seem less wondrous than your joy; and you would accept the seasons of your heart, even as you have always accepted the seasons that pass over your fields.", "The hidden well-spring of your soul must needs rise and run murmuring to the sea; And the treasure of your infinite depths would be revealed to your eyes.", "Let there be no scales to weigh your unknown treasure; And seek not the depths of your knowledge with staff or sounding line. For self is a sea boundless and measureless.", "Say not, \"I have found the truth,\" but rather, \"I have found a truth.\" Say not, \"I have found the path of the soul.\" Say rather, \"I have found the soul walking upon my path.\"", "For the soul walks upon all paths. The soul walks not upon a line, neither does it grow like a reed. The soul unfolds itself, like a lotus of countless petals.", "Your friend is your needs answered. He is your field which you sow with love and reap with thanksgiving. And he is your board and your fireside. For you come to him with your hunger, and you seek him for peace.", "Your friend is your needs answered. He is your field which you sow with love and reap with thanksgiving. And he is your board and your fireside. For you come to him with your hunger, and you seek him for peace.", "Your friend is your needs answered. He is your field which you sow with love and reap with thanksgiving. And he is your board and your fireside. For you come to him with your hunger, and you seek him for peace.", "And let there be no purpose in friendship save the deepening of the spirit. For love that seeks aught but the disclosure of its own mystery is not love but a net cast forth: and only the unprofitable is caught.", "And let there be no purpose in friendship save the deepening of the spirit. For love that seeks aught but the disclosure of its own mystery is not love but a net cast forth: and only the unprofitable is caught.", "And let there be no purpose in friendship save the deepening of the spirit. For love that seeks aught but the disclosure of its own mystery is not love but a net cast forth: and only the unprofitable is caught.", "Of time you would make a stream upon whose bank you would sit and watch its flowing. Yet the timeless in you is aware of life's timelessness, And knows that 'yesterday is but today's memory and tomorrow is today's dream.", "And that which sings and contemplates in you is still dwelling within the bounds of that first moment which scattered the stars into space.", "And is not time even as love is, undivided and paceless? But if in you thought you must measure time into seasons, let each season encircle all the other seasons, And let today embrace the past with remembrance and the future with longing.", "Wisdom ceases to be wisdom when it becomes too proud to weep, too grave to laugh, and too selfish to seek other than itself.", "The teacher who is indeed wise does not bid you to enter the house of his wisdom but rather leads you to the threshold of your mind.", "Life without love is like a tree without blossoms or fruit.", "Keep me away from the wisdom which does not cry, the philosophy which does not laugh and the greatness which does not bow before children.", "We choose our joys and sorrows long before we experience them.", "Be like the flower, turn your face to the sun.", "To understand the heart and mind of a person, look not at what he has already achieved, but at what he aspires to do.", "Your friend is your needs answered.", "In the sweetness of friendship let there be laughter and sharing of pleasures. For in the dew of little things the heart finds its morning and is refreshed.", "Friendship is always a sweet responsibility, never an opportunity.", "Pain and foolishness lead to great bliss and complete knowledge, for Eternal Wisdom created nothing under the sun in vain.", "Let there be no purpose in friendship save the deepening of the spirit.", "A little knowledge that acts is worth infinitely more than much knowledge that is idle.", "Beauty is not in the face; beauty is a light in the heart.", "A man's true wealth is the good he does in the world. Beauty is eternity gazing at itself in a mirror. But you are eternity and you are the mirror.", "A poet is a bird of unearthly excellence, who escapes from his celestial realm arrives in this world warbling. If we do not cherish him, he spreads his wings and flies back into his homeland.", "Advance, and never halt, for advancing is perfection. Advance and do not fear the thorns in the path, for they draw only corrupt blood.", "All that spirits desire, spirits attain.", "And forget not that the earth delights to feel your bare feet and the winds long to play with your hair.", "Art arises when the secret vision of the artist and the manefestation of nature agree to find new shapes.", "Art is a step from what is obvious and well-known toward what is arcane and concealed.", "As one's gifts increase, his friends decrease.", "Cast aside those who liken godliness to whimsy and who try to combine their greed for wealth with their desire for a happy afterlife.", "Coming generations will learn equality from poverty, and love from woes.", "Death most resembles a prophet who is without honor in his own land or a poet who is a stranger among his people.", "Doubt is a pain too lonely to know that faith is his twin brother.", "During the first period of a man's life the greatest danger is not to take the risk. When once the risk has really been taken, then the greatest danger is to risk too much.", "Education sows not seeds in you, but makes your seeds grow.", "Enthusiasm is a volcano on whose top never grows the grass of hesitation.", "Ever has it been that love knows not its own depth until the hour of separation.", "Faith, is a knowledge within the heart, beyond the reach of proof.", "Fear of the devil is one way of doubting God.", "Forget not that the earth delights to feel your bare feet and the winds long to play with your hair.", "Friendship is always a sweet responsibility never an opportunity.", "Generosity is giving more than you can, and pride is taking less than you need.", "Generosity is not giving me that which I need more than you do, but it is giving me that which you need more than I do.", "God has placed in each soul an apostle to lead us upon the illumined path. Yet many seek life from without, unaware that is within them.", "God made Truth with many doors to welcome every believer who knocks on them.", "Half of what I say is meaningless but I say it so that the other half may reach you.", "Hallow the body as a temple to comeliness and sanctify the heart as a sacrifice to love love recompenses the adorers.", "He who has not looked on Sorrow will never see Joy.", "He who requires urging to do a noble act will never accomplish it.", "History does not repeat itself except in the minds of those who do not know history.", "I am indeed rich, since my income is superior to my expense, and my expense is equal to my wishes.", "I existed from all eternity and, behold, I am here and I shall exist till the end of time, for my being has no end.", "I have learnt silence from the talkative, toleration from the intolerant, and kindness from the unkind yet strange, I am ungrateful to these teachers.", "I have learnt silence from the talkative, toleration from the intolerant, and kindness from the unkind; yet strange, I am ungrateful to these teachers.", "I learnt silence from the talkative", "I love you when you bow in your mosque, kneel in your temple, pray in your church. For you and I are sons of one religion, and it is the spirit.", "I prefer to be a dreamer among the humblest, with visions to be realized, than lord among those without dreams and desires.", "I wash my hands of those who imagine chattering to be knowledge, silence to be ignorance, and affection to be art.", "If indeed you must be candid, be candid beautifully.", "If my survival caused another to perish, then death would be sweeter and more beloved.", "If the grandfather of the grandfather of Jesus had known what was hidden within him, he would have stood humble and awe-struck before his soul.", "If you are poor, shun association with him who measures men with the yardstick of riches.", "If you cannot work with love but only with distaste, it is better that you should leave your work.", "If you reveal your secrets to the wind you should not blame the wind for revealing them to the trees.", "In battling evil, excess is good for he who is moderate in announcing the truth is presenting half-truth. He conceals the other half out of fear of the people's wrath.", "In one drop of water are found all the secrets of all the oceans.", "In the depth of my soul there is a wordless song.", "It is slavery to live in the mind unless it has become part of the body.", "It is well to give when asked but it is better to give unasked, through understanding.", "It is well to give when asked, but it is better to give unasked, through understanding.", "It is wrong to think that love comes from long companionship and persevering courtship. Love is the offspring of spiritual affinity and unless that affinity is created in a moment, it will not be created for years or even generations.", "Keep me away from the wisdom that does not cry, the philosophy which does not laugh and the greatness which does not bow before children.", "Knowledge cultivates your seeds and does not sow in you seeds.", "Knowledge of the self is the mother of all knowledge. So it is incumbent on me to know my self, to know it completely, to know its minutiae, its characteristics, its subtleties, and its very atoms.", "Let there be spaces in your togetherness.", "Life without liberty is like a body without spirit.", "Life without love is like a tree without blossoms or fruit.", "Love has no other desire but to fulfill itself. To melt and be like a running brook that sings its melody to the night. To wake at dawn with a winged heart and give thanks for another day of loving.", "Love is know the pain of too much tenderness.", "Man merely discovers' he never can and never will invent.", "Many a doctrine is like a window pane. We see truth through it but it divides us from truth.", "Marriage is the golden ring in a chain, whose beginning is a glance and whose ending is eternity.", "Music is the language of the spirit. It opens the secret of life bringing peace, abolishing strife.", "My friends and my road-fellows, pity the nation that is full of beliefs and empty of religion. Pity the nation that wears a cloth it does not weave, eats a bread it does not harvest, and drinks a wine that flows not from its own winepress.", "Pity the nation that acclaims the bully as hero, and that deems the glittering conqueror bountiful. Pity the nation that raises not its voice save when it walks in a funeral, boasts not except among its ruins, and will rebel not save when its neck is laid between the sword and the block.", "Pity the nation whose statesman is a fox, whose philosopher is a juggler, and whose art is the art of patching and mimicking.", "Pity the nation that welcomes its new ruler with trumpetings, and farewells him with hootings, only to welcome another with trumpetings again. Pity the nation divided into fragments, each fragment deeming itself a nation.", "No lower can a man descend than to interpret his dreams into gold and silver.", "Nor shall derision prove powerful against those who listen to humanity or those who follow in the footsteps of divinity, for they shall live forever. Forever.", "Of life's two chief prizes, beauty and truth, I found the first in a loving heart and the second in a laborer's hand.", "Oh, heart, I the ignorant say to you that the soul perishes like the body, answer that the flower perishes, but the seeds remain. This is the law of God.", "Our worst fault is our preoccupation with the faults of others.", "Pain and foolishness lead to great bliss and complete knowledge, for Eternal Wisdom created nothing under the sun in vain.", "Perplexity is the beginning of knowledge.", "Poetry is a deal of joy and pain and wonder, with a dash of the dictionary.", "Poverty is a veil that obscures the face of greatness. An appeal is a mask covering the face of tribulation.", "Progress lies not in enhancing what is, but in advancing toward what will be.", "Rebellion without truth is like spring in a bleak, arid desert.", "Sadness is but a wall between two gardens.", "Safeguarding the rights of others is the most noble and beautiful end of a human being.", "Say not, 'I have found the truth,' but rather, 'I have found a truth.'", "Tenderness and kindness are not signs of weakness and despair, but manifestations of strength and resolution.", "Tenderness and kindness are not signs of weakness and despair, but manifestations of strength and resolutions.", "The best of men is he who blushes when you praise him and remains silent when you defame him.", "The bird has an honor that man does not have. Man lives in the traps of his abdicated laws and traditions but the birds live according to the natural law of God who causes the earth to turn around the sun.", "The deeper that sorrow carves into your being, the more joy you can contain.", "The eye of a human being is a microscope, which makes the world seem bigger than it really is.", "The giving and receiving of pleasure is a need and an ecstasy.", "The light of the stars that were extinguished ages ago still reaches us. So is it with great men who died centuries ago, but still reach us with the radiations of their personality.", "The lights of stars that were extinguished ages ago still reaches us. So it is with great men who died centuries ago, but still reach us with the radiations of their personalities.", "The most solid stone in the structure is the lowest one in the foundation.", "The optimist sees the rose and not its thorns the pessimist stares at the thorns, oblivious to the rose.", "The person you consider ignorant and insignificant is the one who came from God, that he might learn bliss from grief and knowledge from gloom.", "The reality of the other person lies not in what he reveals to you but in what he cannot reveal to you. Therefore, if you would understand him, listen not to what he says but rather to what he does not say.", "The significance of a man is not in what he attains, but rather what he longs to attain.", "The tears that you spill, the sorrowful, are sweeter than the laughter of snobs and the guffaws of scoffers.", "The timeless in you is aware of life's timelessness and knows that yesterday is but today's memory and tomorrow is today's dream.", "The truly religious man does not embrace a religion and he who embraces one has no religion.", "They consider me to have sharp and penetrating vision because I see them through the mesh of a sieve.", "They deem me mad for I will not sell my days for gold; I deem them mad for they think my days have a price.", "Time has been transformed, and we have changed it has advanced and set us in motion it has unveiled its face, inspiring us with bewilderment and exhilaration.", "To be able to look back upon ones life in satisfaction, is to live twice.", "To be closer to God, be closer to people.", "To realize that prophecy in the people is like fruit in the tree is to know the unity of life.", "To understand the heart and mind of a person, look not at what he has already achieved, but at what he aspires to do.", "Wailing and lamentation befit those who stand before the throne of life and depart without leaving in its hands a drop of the sweat of their brows or the blood of their hearts.", "We choose our joys and sorrows long before we experience them.", "We fear death, yet we long for slumber and beautiful dreams.", "We were a silent, hidden thought in the folds of oblivion, and we have become a voice that causes the heavens to tremble.", "What difference is there between us, save a restless dream that follows my soul but fears to come near you", "What do the nationalists say about killers punishing murderers and thieves sentencing looters", "What is this world that is hastening me toward I know not what, viewing me with contempt", "When we turn to one another for counsel we reduce the number of our enemies.", "When you are sorrowful look again in your heart, and you shall see that in truth you are weeping for that which has been your delight.", "When you have solved all the mysteries of life you long for death, for it is but another mystery of life.", "When you work you fulfil a part of earth's furthest dream, assigned to you when that dream was born. And in keeping yourself with labour you are in truth loving life, And to love life through labour is to be intimate with life's inmost secret.", "Where can I find a man governed by reason instead of habits and urges", "Where is the justice of political power if it executes the murderer and jails the plunderer, and then itself marches upon neighboring lands, killing thousands and pillaging the very hills", "Wisdom stands at the turn in the road and calls upon us publicly, but we consider it false and despise its adherents.", "Work is love made visible. And if you cannot work with love but only with distaste, it is better that you should leave your work and sit at the gate of the temple and take alms of those who work with joy.", "Would that I were a dry well, and that the people tossed stones into me, for that would be easier than to be a spring of flowing water that the thirsty pass by, and from which they avoid drinking.", "Yesterday is but today's memory, and tomorrow is today's dream.", "Yesterday we obeyed kings and bent our necks before emperors. But today we kneel only to truth, follow only beauty, and obey only love.", "You are the bows from which your children as living arrows are sent forth.", "You give but little when you give of your possessions. It is when you give of yourself that you truly give.", "You give little when you give of your possessions. It is when you give of yourself that you truly give.", "You pray in your distress and in your need; would that you might also pray in the fullness of your joy and in your days of abundance.", "You progress not through improving what has been done, but reaching toward what has yet to be done.", "You see but your shadow when you turn your back to the sun.", "Your children are not your children. They are the sons and daughters of Life's longing for itself... You may house their bodies but not their souls, for their souls dwell in the house of tomorrow, which you cannot visit, not even in your dreams.", "Your confidence in the people, and your doubt about them, are closely related to your self-confidence and your self-doubt.", "Your pain is the breaking of the shell that encloses your understanding. Even as the stone of the fruit must break, that its heart may stand in the sun, so must you know pain.", "Zeal is a volcano, the peak of which the grass of indecisiveness does not grow."]}